astrobin_apps_payments/tests/data/lite_once_renewal/payment_intent.succeeded.json

{
  "id": "evt_3NBz3LC0tT6bv7Hd00DgzU0q",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1685101456,
  "data": {
    "object": {
      "id": "pi_3NBz3LC0tT6bv7Hd0i65jNq8",
      "object": "payment_intent",
      "amount": 2100,
      "amount_capturable": 0,
      "amount_details": {
        "tip": {
        }
      },
      "amount_received": 2100,
      "application": null,
      "application_fee_amount": null,
      "automatic_payment_methods": null,
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic",
      "charges": {
        "object": "list",
        "data": [
          {
            "id": "ch_3NBz3LC0tT6bv7Hd0AIFmqsO",
            "object": "charge",
            "amount": 2100,
            "amount_captured": 2100,
            "amount_refunded": 0,
            "application": null,
            "application_fee": null,
            "application_fee_amount": null,
            "balance_transaction": "txn_3NBz3LC0tT6bv7Hd0AsUhQLU",
            "billing_details": {
              "address": {
                "city": null,
                "country": "US",
                "line1": null,
                "line2": null,
                "postal_code": "12345",
                "state": null
              },
              "email": "astrobin@astrobin.com",
              "name": "Test User",
              "phone": null
            },
            "calculated_statement_descriptor": "ASTROBIN",
            "captured": true,
            "created": 1685101455,
            "currency": "usd",
            "customer": "STRIPE_CUSTOMER_ID",
            "description": null,
            "destination": null,
            "dispute": null,
            "disputed": false,
            "failure_balance_transaction": null,
            "failure_code": null,
            "failure_message": null,
            "fraud_details": {
            },
            "invoice": null,
            "livemode": false,
            "metadata": {
            },
            "on_behalf_of": null,
            "order": null,
            "outcome": {
              "network_status": "approved_by_network",
              "reason": null,
              "risk_level": "normal",
              "risk_score": 23,
              "seller_message": "Payment complete.",
              "type": "authorized"
            },
            "paid": true,
            "payment_intent": "pi_3NBz3LC0tT6bv7Hd0i65jNq8",
            "payment_method": "pm_1NBz46C0tT6bv7HdNugEv20e",
            "payment_method_details": {
              "card": {
                "brand": "visa",
                "checks": {
                  "address_line1_check": null,
                  "address_postal_code_check": "pass",
                  "cvc_check": "pass"
                },
                "country": "US",
                "exp_month": 12,
                "exp_year": 2073,
                "fingerprint": "Xi05hB6PSTV4ACeF",
                "funding": "credit",
                "installments": null,
                "last4": "4242",
                "mandate": null,
                "network": "visa",
                "network_token": {
                  "used": false
                },
                "three_d_secure": null,
                "wallet": null
              },
              "type": "card"
            },
            "receipt_email": "astrobin@astrobin.com",
            "receipt_number": null,
            "receipt_url": "https://pay.stripe.com/receipts/payment/CAcaFwoVYWNjdF8xQlc4ajNDMHRUNmJ2N0hkKJC3wqMGMgZGJzfHwTs6LBYoMPREnwZFNce8kqnPTcNNGTboNaaApgeST087N11pL6g8CW5504TBq24d",
            "refunded": false,
            "refunds": {
              "object": "list",
              "data": [
              ],
              "has_more": false,
              "total_count": 0,
              "url": "/v1/charges/ch_3NBz3LC0tT6bv7Hd0AIFmqsO/refunds"
            },
            "review": null,
            "shipping": null,
            "source": null,
            "source_transfer": null,
            "statement_descriptor": null,
            "statement_descriptor_suffix": null,
            "status": "succeeded",
            "transfer_data": null,
            "transfer_group": null
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/charges?payment_intent=pi_3NBz3LC0tT6bv7Hd0i65jNq8"
      },
      "client_secret": "pi_3NBz3LC0tT6bv7Hd0i65jNq8_secret_tcfNWSVgfqYOMROYMgYMPwNl5",
      "confirmation_method": "automatic",
      "created": 1685101407,
      "currency": "usd",
      "customer": "STRIPE_CUSTOMER_ID",
      "description": null,
      "invoice": null,
      "last_payment_error": null,
      "latest_charge": "ch_3NBz3LC0tT6bv7Hd0AIFmqsO",
      "livemode": false,
      "metadata": {
      },
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": "pm_1NBz46C0tT6bv7HdNugEv20e",
      "payment_method_options": {
        "card": {
          "installments": null,
          "mandate_options": null,
          "network": null,
          "request_three_d_secure": "automatic"
        }
      },
      "payment_method_types": [
        "card"
      ],
      "processing": null,
      "receipt_email": "astrobin@astrobin.com",
      "review": null,
      "setup_future_usage": null,
      "shipping": null,
      "source": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "succeeded",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": "req_RwLPWCpbKcRgCd",
    "idempotency_key": "c21f2d16-48c6-4496-a3bf-e1248bd15508"
  },
  "type": "payment_intent.succeeded"
}
